Things to learn 

1) what is data frames
2) what is data series

In [1]:
import pandas as pd
import numpy as np

In [3]:
# dataframes

df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['R1','R2','R3','R4','R5'],columns=['C1','C2','C3','C4'])

In [4]:
df.head()

    C1  C2  C3  C4
R1   0   1   2   3
R2   4   5   6   7
R3   8   9  10  11
R4  12  13  14  15
R5  16  17  18  19

In [5]:
# df.to_csv('file_name.csv')   use to convert dataframe into a file

In [6]:
#accessing elements
# 1.  .loc  focus on row index
# 2.  .iloc  focus on row as well as column index

df.loc['R1']

C1    0
C2    1
C3    2
C4    3
Name: R1, dtype: int32

In [8]:
type(df.loc['R1']) # this is data series

pandas.core.series.Series

# what is the difference between data frame and series

data is data frame when no of rows >1 and no of columns>1
eg:
	C1	C2	C3	C4
R1	0	1	2	3
R2	4	5	6	7

data is data series when no of rows =1 or no of columns=1
eg:
previous snipet

In [9]:
df.iloc[:,:]

    C1  C2  C3  C4
R1   0   1   2   3
R2   4   5   6   7
R3   8   9  10  11
R4  12  13  14  15
R5  16  17  18  19

In [10]:
df.iloc[:2,:3]

    C1  C2  C3
R1   0   1   2
R2   4   5   6

In [11]:
df.iloc[0:2,:1]

    C1
R1   0
R2   4

In [12]:
type(df.iloc[0:2,:1])

#this is still a dataframe and not a series as series has either rows or columms

pandas.core.frame.DataFrame

In [14]:
df.iloc[0:2,0]

R1    0
R2    4
Name: C1, dtype: int32

In [15]:
type(df.iloc[0:2,0])

#this is a series

pandas.core.series.Series

In [16]:
#dataframes into arrays

df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [17]:
#how to check null values 

df.isnull().sum() #gives us the count of null values in each column

C1    0
C2    0
C3    0
C4    0
dtype: int64

In [18]:
df['C1'].value_counts() # counts the occurance of elements in column 1

0     1
4     1
8     1
12    1
16    1
Name: C1, dtype: int64

In [19]:
df['C1'].unique()

array([ 0,  4,  8, 12, 16])

In [21]:
# instead of loc and iloc we can use this 

df[['C1','C2']]

    C1  C2
R1   0   1
R2   4   5
R3   8   9
R4  12  13
R5  16  17

# TUT 2

In [24]:
df=pd.read_csv('test.csv')  
#csv = comma separated values

In [25]:
df.head()

,ID,X0,X1,X2,X3,X4,X5,X6,X8,X10,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,1,az,v,n,f,d,t,a,w,0,...,0,0,0,1,0,0,0,0,0,0
1,2,t,b,ai,a,d,b,g,y,0,...,0,0,1,0,0,0,0,0,0,0
2,3,az,v,as,f,d,a,j,j,0,...,0,0,0,1,0,0,0,0,0,0
3,4,az,l,n,f,d,z,l,n,0,...,0,0,0,1,0,0,0,0,0,0
4,5,w,s,as,c,d,y,i,m,0,...,1,0,0,0,0,0,0,0,0,0

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4209 entries, 0 to 4208
Columns: 377 entries, ID to X385
dtypes: int64(369), object(8)
memory usage: 12.1+ MB

In [27]:
df.describe()

,ID,X10,X11,X12,X13,X14,X15,X16,X17,X18,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
count,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,...,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000
mean,4211.039202,0.019007,0.000238,0.074364,0.061060,0.427893,0.000713,0.002613,0.008791,0.010216,...,0.325968,0.049656,0.311951,0.019244,0.011879,0.008078,0.008791,0.000475,0.000713,0.001663
std,2423.078926,0.136565,0.015414,0.262394,0.239468,0.494832,0.026691,0.051061,0.093357,0.100570,...,0.468791,0.217258,0.463345,0.137399,0.108356,0.089524,0.093357,0.021796,0.026691,0.040752
min,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2115.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,4202.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,6310.000000,0.000000,0.000000,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,...,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,8416.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [28]:
df['X0'].value_counts()

ak    432
y     348
z     335
x     302
ay    299
t     293
o     246
f     213
w     198
j     171
n     167
aj    162
az    161
s     116
ap    108
al     88
h      64
d      61
e      48
v      40
ai     38
m      34
af     34
am     28
i      25
at     21
u      20
ba     19
a      18
b      13
k      12
ad     12
aq     11
aw     11
r      10
ax      8
l       6
bc      6
c       6
as      6
ao      5
au      5
g       3
p       1
ae      1
av      1
an      1
ag      1
bb      1
Name: X0, dtype: int64

In [29]:
df[df['ID'] >50] ##id >50 values

,ID,X0,X1,X2,X3,X4,X5,X6,X8,X10,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
28,51,f,s,m,c,d,j,g,a,0,...,0,0,1,0,0,0,0,0,0,0
29,53,az,p,as,f,d,j,g,a,0,...,0,0,0,1,0,0,0,0,0,0
30,55,w,s,as,c,d,j,g,h,0,...,1,0,0,0,0,0,0,0,0,0
31,56,t,aa,as,c,d,j,j,s,0,...,0,1,0,0,0,0,0,0,0,0
32,57,aj,s,as,c,d,j,i,v,0,...,1,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4204,8410,aj,h,as,f,d,aa,j,e,0,...,0,0,0,0,0,0,0,0,0,0
4205,8411,t,aa,ai,d,d,aa,j,y,0,...,0,1,0,0,0,0,0,0,0,0
4206,8413,y,v,as,f,d,aa,d,w,0,...,0,0,0,0,0,0,0,0,0,0
4207,8414,ak,v,as,a,d,aa,c,q,0,...,0,0,1,0,0,0,0,0,0,0
4208,8416,t,aa,ai,c,d,aa,g,r,0,...,1,0,0,0,0,0,0,0,0,0

#  CSV

In [30]:
from io import StringIO, BytesIO

In [31]:
data=('col1,col2,col3\n'
         'x,y,1\n'
         'a,b,2\n'
         'c,d,3')

In [32]:
type(data)

str

In [33]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [36]:
df=pd.read_csv(StringIO(data),usecols=['col1','col3'] ) #include specific cols

In [37]:
df.head()

  col1  col3
0    x     1
1    a     2
2    c     3

In [ ]:
# df.to_csv('file_name.csv')  to convert df into file

In [46]:
## specifying clumns data types

data=('a,b,c,d\n'
         '1,2,3,4\n'
         '5,6,7,8\n'
         '9,10,11,12')

In [40]:
print(data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11

In [42]:
df=pd.read_csv(StringIO(data),dtype=object)

In [43]:
df

   a   b   c    d
0  1   2   3    4
1  5   6   7    8
2  9  10  11  NaN

In [44]:
df['a']

0    1
1    5
2    9
Name: a, dtype: object

In [53]:
df['a'][1]

5

In [47]:
df=pd.read_csv(StringIO(data),dtype=float)

In [48]:
df

     a     b     c     d
0  1.0   2.0   3.0   4.0
1  5.0   6.0   7.0   8.0
2  9.0  10.0  11.0  12.0

In [50]:
df=pd.read_csv(StringIO(data),dtype={'b':int,'c':float,'a':'Int64'})

In [51]:
df

   a   b     c   d
0  1   2   3.0   4
1  5   6   7.0   8
2  9  10  11.0  12

In [54]:
df.dtypes
#to check datatypes

a      Int64
b      int32
c    float64
d      int64
dtype: object

In [55]:
df

   a   b     c   d
0  1   2   3.0   4
1  5   6   7.0   8
2  9  10  11.0  12

now we can see from above that there is another 0th column generated autmoatically , but if we dont want that we do:

In [56]:
df=pd.read_csv(StringIO(data),index_col=0)

In [57]:
df

    b   c   d
a
1   2   3   4
5   6   7   8
9  10  11  12

In [58]:
df=pd.read_csv(StringIO(data),index_col=1)

df

    a   c   d
b
2   1   3   4
6   5   7   8
10  9  11  12